Revit 2027 API
RebarShapeDefinition.HasParameter Method
 Whether the definition stores the parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasParameter(
	ElementId paramId
)
Public Function HasParameter (
	paramId As ElementId
) As Boolean
public:
bool HasParameter(
	ElementId^ paramId
)
member HasParameter :
        paramId : ElementId -> bool
Parameters
paramId ElementId
 Id of a parameter.
Return Value
Boolean
 True if the definition stores the parameter, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace